import React from "react";
import "../styles/clean-ai.css";

const AI = () => {
  return (
    <div className="ai-page">
      <div className="ai-container">
        <div className="ai-icon">🤖</div>
        <div className="ai-message">
          <h2>Искусственный интеллект</h2>
          <p>
            <strong>Эта функция находится в разработке</strong>
            <br /><br />
            Наш создатель Бектур старается внедрить в StudyCore
            возможности искусственного интеллекта, чтобы помочь вам в учебе.
            P. S. можете пользоваться ChatGPT или другими ИИ-сервисами пока что 🙃
          </p>
          
          <div className="ai-features">
            <h3>Планируемые возможности:</h3>
            <ul>
              <li>Удобный помощник по темам</li>
              <li>Помощник по решению домашник заданий</li>
            </ul>
          </div>

          <div className="ai-loading">
            <span></span>
            <span></span>
            <span></span>
          </div>
        </div>
      </div>
    </div>
  );
};

export default AI;
